VMs/Results/NoFirewall/Fio/results_3.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43862: Tue Dec 10 19:15:28 2024
  read: IOPS=1463, BW=5854KiB/s (5995kB/s)(1715MiB/300001msec)
    slat (usec): min=10, max=17846, avg=226.05, stdev=505.16
    clat (usec): min=3, max=12962, avg=366.28, stdev=522.57
     lat (usec): min=16, max=17885, avg=645.93, stdev=758.28
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   21], 40.00th=[  277], 50.00th=[  314], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  478], 90.00th=[  701], 95.00th=[ 1029],
     | 99.00th=[ 2638], 99.50th=[ 3490], 99.90th=[ 5735], 99.95th=[ 6783],
     | 99.99th=[ 9241]
   bw (  KiB/s): min= 2850, max= 8806, per=25.03%, avg=5861.00, stdev=1145.07, samples=599
   iops        : min=  712, max= 2201, avg=1465.02, stdev=286.28, samples=599
  lat (usec)   : 4=0.04%, 10=20.62%, 20=9.07%, 50=2.14%, 100=0.72%
  lat (usec)   : 250=1.28%, 500=47.44%, 750=9.86%, 1000=3.61%
  lat (msec)   : 2=3.45%, 4=1.42%, 10=0.33%, 20=0.01%
  cpu          : usr=5.05%, sys=34.41%, ctx=495602, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=439053,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43863: Tue Dec 10 19:15:28 2024
  read: IOPS=1473, BW=5894KiB/s (6036kB/s)(1727MiB/300001msec)
    slat (usec): min=11, max=14992, avg=222.86, stdev=488.68
    clat (usec): min=3, max=13836, avg=364.61, stdev=514.94
     lat (usec): min=16, max=22422, avg=640.38, stdev=742.15
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   21], 40.00th=[  277], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  478], 90.00th=[  701], 95.00th=[ 1029],
     | 99.00th=[ 2606], 99.50th=[ 3490], 99.90th=[ 5669], 99.95th=[ 6652],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2538, max= 8936, per=25.19%, avg=5898.62, stdev=1192.35, samples=599
   iops        : min=  634, max= 2234, avg=1474.43, stdev=298.10, samples=599
  lat (usec)   : 4=0.02%, 10=19.74%, 20=9.83%, 50=2.12%, 100=0.82%
  lat (usec)   : 250=1.23%, 500=47.61%, 750=9.86%, 1000=3.58%
  lat (msec)   : 2=3.47%, 4=1.38%, 10=0.33%, 20=0.01%
  cpu          : usr=5.28%, sys=34.37%, ctx=494380, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=442076,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43864: Tue Dec 10 19:15:28 2024
  read: IOPS=1452, BW=5809KiB/s (5948kB/s)(1702MiB/300001msec)
    slat (usec): min=10, max=13425, avg=224.29, stdev=497.40
    clat (usec): min=3, max=16053, avg=370.51, stdev=533.06
     lat (usec): min=16, max=20641, avg=649.86, stdev=764.05
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   21], 40.00th=[  277], 50.00th=[  314], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  486], 90.00th=[  717], 95.00th=[ 1057],
     | 99.00th=[ 2704], 99.50th=[ 3589], 99.90th=[ 5866], 99.95th=[ 6915],
     | 99.99th=[ 9372]
   bw (  KiB/s): min= 2618, max= 9114, per=24.84%, avg=5816.62, stdev=1080.86, samples=599
   iops        : min=  654, max= 2278, avg=1453.93, stdev=270.21, samples=599
  lat (usec)   : 4=0.02%, 10=19.58%, 20=10.04%, 50=2.20%, 100=0.87%
  lat (usec)   : 250=1.23%, 500=46.89%, 750=10.10%, 1000=3.69%
  lat (msec)   : 2=3.56%, 4=1.45%, 10=0.36%, 20=0.01%
  cpu          : usr=5.09%, sys=34.37%, ctx=492560, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=435670,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43865: Tue Dec 10 19:15:28 2024
  read: IOPS=1463, BW=5855KiB/s (5995kB/s)(1715MiB/300001msec)
    slat (usec): min=10, max=14071, avg=226.28, stdev=498.59
    clat (usec): min=3, max=16890, avg=362.77, stdev=515.99
     lat (usec): min=15, max=17154, avg=645.69, stdev=753.13
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   20], 40.00th=[  273], 50.00th=[  310], 60.00th=[  343],
     | 70.00th=[  392], 80.00th=[  478], 90.00th=[  701], 95.00th=[ 1020],
     | 99.00th=[ 2606], 99.50th=[ 3458], 99.90th=[ 5604], 99.95th=[ 6521],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2941, max= 9960, per=25.02%, avg=5858.96, stdev=1124.56, samples=599
   iops        : min=  735, max= 2490, avg=1464.50, stdev=281.15, samples=599
  lat (usec)   : 4=0.04%, 10=20.54%, 20=9.77%, 50=2.00%, 100=0.76%
  lat (usec)   : 250=1.31%, 500=46.88%, 750=9.93%, 1000=3.60%
  lat (msec)   : 2=3.44%, 4=1.40%, 10=0.32%, 20=0.01%
  cpu          : usr=5.25%, sys=34.29%, ctx=493268, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=439124,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 5809KiB/s-5894KiB/s (5948kB/s-6036kB/s), io=6859MiB (7192MB), run=300001-300001msec

Disk stats (read/write):
  dm-0: ios=1456670/0, merge=0/0, ticks=338704/0, in_queue=338704, util=100.00%

Disk stats (read/write):
  sda: ios=1456783/0, merge=0/0, ticks=341749/0, in_queue=341749, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 19:15:28 2024
  read: IOPS=5853, BW=22.9Mi (24.0M)(6859MiB/300001msec)
    slat (usec): min=10, max=17846, avg=224.07, stdev=428.58
    clat (usec): min=3, max=16890, avg=365.61, stdev=451.50
     lat (usec): min=15, max=22422, avg=644.06, stdev=652.21
   bw (  KiB/s): min= 8097, max=28010, per=18.77%, avg=17574.20, stdev=1132.89, samples=1797
   iops        : min= 2023, max= 7002, avg=4392.86, stdev=283.23, samples=1797
  lat (usec)   : 4=0.03%, 10=20.12%, 20=9.68%, 50=2.11%, 100=0.79%
  lat (usec)   : 250=1.26%, 500=47.21%, 750=9.94%, 1000=3.62%
  lat (msec)   : 2=3.48%, 4=1.41%, 10=0.34%, 20=0.01%
  cpu          : usr=5.16%, sys=34.36%, ctx=1975810, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1755923,0,0,0 short=0,0,0,0 dropped=0,0,0,0